tests/performance/scenarios/test-histovec-v1-utac.yml
config:
  environments:
    api-dev:
      target: "http://nginx-dev"
      phases:
        - duration: 10
          arrivalRate: 10
        - duration: 10
          arrivalRate: 20
      payload:
        path: ids.csv
        fields:
          - idv
    api:
      target: "http://nginx"
      phases:
        - duration: 5
          arrivalRate: 2
        - duration: 5
          arrivalRate: 5
      payload:
        path: ids.csv
        fields:
          - idv
    api-perf:
      target: "http://nginx"
      phases:
        - duration: 30
          arrivalRate: 2
        - duration: 30
          arrivalRate: 5
        - duration: 30
          arrivalRate: 10
        - duration: 30
          arrivalRate: 20
        - duration: 60
          arrivalRate: 50
        - pause: 5
          arrivalRate: 100
        - pause: 10
        - duration: 60
          arrivalRate: 150
        - pause: 10
        - duration: 60
          arrivalRate: 200
        - pause: 10
        - duration: 60
          arrivalRate: 300
      payload:
        path: ids.csv
        fields:
          - idv
scenarios:
  - name: histovec-v1-utac
    flow:
    - post:
        url: /histovec/api/v1/siv
        json:
          uuid: 8ebf2ad7-ec0f-f4d5-d974-995e07f199cf
          id: "{{ idv }}"
        capture:
          - json: "$.token"
            as: "token"
          - json: "$.v"
            as: "v"
    - post:
        url: /histovec/api/v1/utac
        json:
          uuid: 8ebf2ad7-ec0f-f4d5-d974-995e07f199cf
          id: "{{ idv }}"
          code: "{{ idv }}"
          key: "eetuDnUDIB7AsbOibYClLxSz2pPWSP2kyj2qWn0REpY="
          token: "{{ token }}"
          encryptedImmat: "{{ token }}"
        capture:
          json: "$.ct"
          as: "ct"